
// ================================================================================================
// -*- C++ -*-
// File:   sample_d3d11.cpp
// Author: Guilherme R. Lampert
// Brief:  D3D11 Debug Draw sample. Also uses the newer explicit context API.
//
// This software is in the public domain. Where that dedication is not recognized,
// you are granted a perpetual, irrevocable license to copy, distribute, and modify
// this file as you see fit.
// ================================================================================================

#define DEBUG_DRAW_IMPLEMENTATION
#include "DebugDrawDX11.hpp"

#include <cstdlib>
#include <tuple>

#define NOIME
#define NOMINMAX
#define WIN32_LEAN_AND_MEAN
#include <ShellScalingAPI.h>
#include <windows.h>

#include <dxgi.h>
#include <d3d11.h>
#include <d3d11_1.h>
#include <d3dcompiler.h>
#include <DirectXMath.h> 
#include "debug-draw/samples/vectormath/vectormath.h"

#pragma comment(lib, "Shcore")
#pragma comment(lib, "d3d11")
#pragma comment(lib, "dxguid")
#pragma comment(lib, "d3dcompiler")


static constexpr auto ddShaderCodeASCII = R"(
///////////////////////////////////////////////////////////////////////////////

Texture2D    glyphsTexture : register(t0);
SamplerState glyphsSampler : register(s0);

cbuffer ConstantBufferData : register(b0)
{
    matrix mvpMatrix;
    float4 screenDimensions;
};

///////////////////////////////////////////////////////////////////////////////

struct VertexInput
{
    float4 pos   : POSITION;
    float4 uv    : TEXCOORD;
    float4 color : COLOR;
};

struct VertexOutput
{
    float4 vpos  : SV_POSITION;
    float4 uv    : TEXCOORD;
    float4 color : COLOR;
};

///////////////////////////////////////////////////////////////////////////////
// Line/point drawing:
///////////////////////////////////////////////////////////////////////////////

VertexOutput VS_LinePoint(VertexInput input)
{
    VertexOutput output;
    output.vpos  = mul(input.pos, mvpMatrix);
    output.uv    = input.uv;
    output.color = input.color;
    return output;
}

float4 PS_LinePoint(VertexOutput input) : SV_TARGET
{
    return input.color;
}

///////////////////////////////////////////////////////////////////////////////
// Text glyphs drawing:
///////////////////////////////////////////////////////////////////////////////

VertexOutput VS_TextGlyph(VertexInput input)
{
    // Map to normalized clip coordinates:
    float x = ((2.0 * (input.pos.x - 0.5)) / screenDimensions.x) - 1.0;
    float y = 1.0 - ((2.0 * (input.pos.y - 0.5)) / screenDimensions.y);

    VertexOutput output;
    output.vpos  = float4(x, y, 0.0, 1.0);
    output.uv    = input.uv;
    output.color = input.color;
    return output;
}

float4 PS_TextGlyph(VertexOutput input) : SV_TARGET
{
    float4 texColor  = glyphsTexture.Sample(glyphsSampler, input.uv.xy);
    float4 fragColor = input.color;

    fragColor.a = texColor.r;
    return fragColor;
}
)";

namespace Devil3 {
    // Created with ReClass.NET 1.2 by KN4CK3R
#pragma pack(push, r1, 1)
    class cCameraControl
    {
    public:
        char pad_0008[8]; //0x0008
        Vector3 up; //0x0010
        float FOV; //0x0020
        float roll; //0x0024
        float unused0; //0x0028
        uint32_t unused1; //0x002C
        Matrix4 transform; //0x0030
        Vector4 eye; //0x0070
        Vector4 lookat; //0x0080
        char pad_0090[32]; //0x0090

        virtual void Function0();
        virtual void Function1();
        virtual void Function2();
        virtual void Function3();
        virtual void Function4();
        virtual void Function5();
        virtual void Function6();
        virtual void Function7();
        virtual void Function8();
        virtual void Function9();
    }; //Size: 0x00B0

    class sCameraCtrlPtr
    {
    public:
        class cCameraControl* pCameraControl; //0x0000
        char pad_0008[56]; //0x0008
    }; //Size: 0x0040

#pragma pack(pop, r1)
}

// ========================================================
// Helper functions
// ========================================================

static void panicF(const char* format, ...)
{
    va_list args;
    char buffer[2048] = { '\0' };

    va_start(args, format);
    std::vsnprintf(buffer, sizeof(buffer), format, args);
    va_end(args);

    MessageBoxA(nullptr, buffer, "Fatal Error", MB_OK);
    std::abort();
}

// ========================================================
// DebugDraw Camera
// ========================================================
namespace dd {

    // Angle in degrees to angle in radians for sin/cos/etc.
    static inline float degToRad(const float degrees)
    {
        return (degrees * 3.1415926535897931f / 180.0f);
    }

    struct Camera
    {
        //
        // Camera Axes:
        //
        //    (up)
        //    +Y   +Z (forward)
        //    |   /
